//**************************************************************
//
//	Player.h
//	プレイヤー制御処理
//
//--------------------------------------------------------------
//	製作者：柴山凜太郎
//--------------------------------------------------------------
//	開発履歴
//	2021/12/09	プレイヤー制御処理の実装開始
//
//**************************************************************
#pragma once
#ifndef __PLAYER_H__
#define __PLAYER_H__


// ---プレイヤークラス
class Player
{
public:
	Player();
	~Player();

	void InitPlayer();		// 初期化
	void UninitPlayer();	// 終了
	void UpdatePlayer();	// 更新
	void DrawPlayer();		// 描画

private:

};

#endif // !__PLAYER_H__

